vtorkalo/TableController/stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define POWER_FAILURE_Pin GPIO_PIN_0
#define POWER_FAILURE_GPIO_Port GPIOA
#define BRIDGE1_LEFT_HIGH_Pin GPIO_PIN_0
#define BRIDGE1_LEFT_HIGH_GPIO_Port GPIOB
#define BRIDGE_RIGHT_HIGH_Pin GPIO_PIN_1
#define BRIDGE_RIGHT_HIGH_GPIO_Port GPIOB
#define BRIDGE1_LEFT_LOW_Pin GPIO_PIN_2
#define BRIDGE1_LEFT_LOW_GPIO_Port GPIOB
#define BRIDGE1_RIGHT_LOW_Pin GPIO_PIN_10
#define BRIDGE1_RIGHT_LOW_GPIO_Port GPIOB
#define MOTOR1_ENCODER_Pin GPIO_PIN_8
#define MOTOR1_ENCODER_GPIO_Port GPIOC
#define BUTTON1_Pin GPIO_PIN_8
#define BUTTON1_GPIO_Port GPIOA
#define BUTTON2_Pin GPIO_PIN_9
#define BUTTON2_GPIO_Port GPIOA
#define BUTTON3_Pin GPIO_PIN_10
#define BUTTON3_GPIO_Port GPIOA
#define BUTTON4_Pin GPIO_PIN_11
#define BUTTON4_GPIO_Port GPIOA
#define BUTTON5_Pin GPIO_PIN_12
#define BUTTON5_GPIO_Port GPIOA
#define EEPROM_SCL_Pin GPIO_PIN_6
#define EEPROM_SCL_GPIO_Port GPIOB
#define EEPROM_SDA_Pin GPIO_PIN_7
#define EEPROM_SDA_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
